src/DataProcessors/ПечатьСправочников/ПечатьСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьСправочников</name>
  <tabularSections>
    <name>Элементы</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DefinedType.СправочникиДляПечатиШК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>CatalogRef.ХранилищеШаблонов</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЭ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Catalogs/ХранилищеШаблонов/ХранилищеШаблонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеШаблонов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ШаблонШКСправочника</name>
      <description>Шаблон ШК справочника</description>
    </items>
  </predefined>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>EnumRef.ТипыШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСоздал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИзменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоВертикали</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоГоризонтали</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ПечатьСправочников/ObjectModule.bsl
Процедура ЗаполнитьЭлементами(Масс) Экспорт 
	//шаблон=Константы.ШаблонПечатиГрупповыхСтикеров.Получить();
	МассивПрефиксов  = ПолучитьПрефиксСправочника(Масс[0]);

	Для каждого стр из масс Цикл
		Для Каждого описаниеШК из МассивПрефиксов Цикл
			новыйЭлемент				= Элементы.Добавить();
			новыйЭлемент.Количество		= 1;
			новыйЭлемент.Ссылка			= стр;
			новыйЭлемент.Шаблон			= Справочники.ХранилищеШаблонов.ШаблонШКСправочника;
			
			Если ТипЗнч(стр)	= Тип("СправочникСсылка.Посылки") Тогда
				Если не ЗначениеЗаполнено(стр.ШК) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для "+стр+"Не заполнено поле ШК");
					Продолжить;
				КонецЕсли;	
				новыйЭлемент.Штрихкод	= стр.ШК;
			Иначе
				новыйЭлемент.Штрихкод 	= ОписаниеШК.Префикс+стр.Код+ОписаниеШК.Действие;	
			КонецЕсли;	
			
			НовыйЭлемент.Описание 		= ОписаниеШК.Описание;
			НовыйЭлемент.ТипЭ 			= ТипЗнч(Масс[0]);
		КонецЦикла
	КонецЦикла;
	//Если ПрефиксШК="55" Тогда
	//	"55"+Выборка.Код+"01000"
	//КонецЕсли;
КонецПроцедуры	

Функция ПолучитьПрефиксСправочника(Спр)
	массивПрефиксов = Новый Массив;
	Если ТипЗнч(Спр)=Тип("СправочникСсылка.Габариты") Тогда	
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "62","Выбрать",""));
	ИначеЕсли ТипЗнч(Спр)=Тип("СправочникСсылка.МестаХранения") Тогда	
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "63","Выбрать",""));		
	ИначеЕсли ТипЗнч(Спр)=Тип("СправочникСсылка.Номенклатура") Тогда	
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "61","Продать",""));		
	ИначеЕсли ТипЗнч(Спр)=Тип("СправочникСсылка.Сотрудники") Тогда	
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "55","Записать и закрыть","01000"));		
	ИначеЕсли ТипЗнч(Спр)=Тип("СправочникСсылка.ТочкиРаздачи") Тогда	
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "64","Открыть ""Выдачу транзита""","01"));
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "64","Открыть ""Формирование коробки""","02"));
	Иначе
		массивПрефиксов.Добавить(новый Структура("Префикс, Описание, Действие", "","",""));
	КонецЕсли;
	Возврат массивПрефиксов;
КонецФункции
